---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetProductListEntryCount
source: html/498b891e-e621-3efa-1242-598e1ac816f0.htm
---
# Autodesk.Revit.DB.FabricationPart.GetProductListEntryCount Method

Gets the number of product entries for this part.

## Syntax (C#)
```csharp
public int GetProductListEntryCount()
```

## Returns
Returns the number of product entries.